yuri-tnk/USB-FWU/LPC214X_USB_APP/usb_app/utils.c
/*
TNKernel real-time kernel - USB examples

Copyright © 2004,2006 Yuri Tiomkin
All rights reserved.

Permission to use, copy, modify, and distribute this software in source
and binary forms and its documentation for any purpose and without fee
is hereby granted, provided that the above copyright notice appear
in all copies and that both that copyright notice and this permission
notice appear in supporting documentation.

THIS SOFTWARE IS PROVIDED BY THE YURI TIOMKIN AND CONTRIBUTORS ``AS IS'' AND
ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL YURI TIOMKIN OR CONTRIBUTORS BE LIABLE
FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
SUCH DAMAGE.
*/

#include "lpc214x.h"
#include "utils.h"
#include "../../tnkernel/tn.h"
#include "tn_usb_hw.h"
#include "tn_usb.h"


//----------------------------------------------------------------------------
//    VALID ONLY FOR 'LPC2146 USB APPLICATION' PROJECT
//----------------------------------------------------------------------------

/*-------- Project specific pinout description ------

                                        I/O dir set            I/O dir
                                       -------------          ---------

 P0.0  - TxD0          U-TXD-2             auto                  out
 P0.1  - RxD0          U-RXD0-2            auto                  in
 P0.2 -  GPIO          Not used            manual                Out
 P0.3  - GPIO          Not used            manual                out
 P0.4  - GPIO          Not used            manual                out
 P0.5  - GPIO          Not used            manual                out
 P0.6  - GPIO          Not used            manual                out
 P0.7  - GPIO          Not used            manual                out
 P0.8  - GPIO          Not used            manual                out
 P0.9  - GPIO          Not used            manual                out
 P0.10 - GPIO          Not used            manual                out
 P0.11 - GPIO          Not used            manual                out
 P0.12 - GPIO          Not used            manual                out
 P0.13 - GPIO          Not used            manual                out
 P0.14 - sys input     LED                 manual                out
 P0.15 - GPIO          Not used            manual                out
 P0.16 - GPIO          Not used            manual                out
 P0.17 - GPIO          Not used            manual                out
 P0.18 - GPIO          Not used            manual                out
 P0.19 - GPIO          Not used            manual                out
 P0.20 - GPIO          Not used            manual                out
 P0.21 - GPIO          Not used            manual                out
 P0.22 - GPIO          Not used            manual                out
 P0.23 - VBUS          VBUS                auto                  in
 P0.24 - not exists    ???
 P0.25 - GPIO          Not used            manual                out
 P0.26 - GPIO          Not used            manual                out
 P0.27 - GPIO          AUX2                manual                out
 P0.28 - GPIO          AUX4                manual                out
 P0.29 - GPIO          AUX5                manual                out
 P0.30 - GPIO          Not used            manual                out
 P0.31 - CONNECT       CONNECT             auto                  out

 P1.16 - GPIO          Not used            manual                out
 P1.17 - GPIO          AUX3                manual                out
 P1.18 - GPIO          Not used            manual                out
 P1.19 - GPIO          Not used            manual                out
 P1.20 - GPIO          Not used            auto                  in
 P1.21 - GPIO          Not used            manual                out
 P1.22 - GPIO          Not used            manual                out
 P1.23 - GPIO          Not used            manual                out
 P1.24 - GPIO          Not used            manual                out
 P1.25 - GPIO          Not used            manual                out
 P1.26 - GPIO          Not used            auto                  in
 P1.27 - TDO
 P1.28 - TDI
 P1.29 - TCK
 P1.30 - TMS
 P1.31 - TRST
----------------------------------------------------------------------------*/

static void InitUART0(void);
static void InitUSB(void);  //-- external

//--- Checking .data segment only - you may omit it
volatile int chk_data_seg = 0x12345678;

const unsigned int crc32_ref_table[] =
{
   0x00000000,0x77073096,0xEE0E612C,0x990951BA,0x076DC419,0x706AF48F,
   0xE963A535,0x9E6495A3,0x0EDB8832,0x79DCB8A4,0xE0D5E91E,0x97D2D988,
   0x09B64C2B,0x7EB17CBD,0xE7B82D07,0x90BF1D91,0x1DB71064,0x6AB020F2,
   0xF3B97148,0x84BE41DE,0x1ADAD47D,0x6DDDE4EB,0xF4D4B551,0x83D385C7,
   0x136C9856,0x646BA8C0,0xFD62F97A,0x8A65C9EC,0x14015C4F,0x63066CD9,
   0xFA0F3D63,0x8D080DF5,0x3B6E20C8,0x4C69105E,0xD56041E4,0xA2677172,
   0x3C03E4D1,0x4B04D447,0xD20D85FD,0xA50AB56B,0x35B5A8FA,0x42B2986C,
   0xDBBBC9D6,0xACBCF940,0x32D86CE3,0x45DF5C75,0xDCD60DCF,0xABD13D59,
   0x26D930AC,0x51DE003A,0xC8D75180,0xBFD06116,0x21B4F4B5,0x56B3C423,
   0xCFBA9599,0xB8BDA50F,0x2802B89E,0x5F058808,0xC60CD9B2,0xB10BE924,
   0x2F6F7C87,0x58684C11,0xC1611DAB,0xB6662D3D,0x76DC4190,0x01DB7106,
   0x98D220BC,0xEFD5102A,0x71B18589,0x06B6B51F,0x9FBFE4A5,0xE8B8D433,
   0x7807C9A2,0x0F00F934,0x9609A88E,0xE10E9818,0x7F6A0DBB,0x086D3D2D,
   0x91646C97,0xE6635C01,0x6B6B51F4,0x1C6C6162,0x856530D8,0xF262004E,
   0x6C0695ED,0x1B01A57B,0x8208F4C1,0xF50FC457,0x65B0D9C6,0x12B7E950,
   0x8BBEB8EA,0xFCB9887C,0x62DD1DDF,0x15DA2D49,0x8CD37CF3,0xFBD44C65,
   0x4DB26158,0x3AB551CE,0xA3BC0074,0xD4BB30E2,0x4ADFA541,0x3DD895D7,
   0xA4D1C46D,0xD3D6F4FB,0x4369E96A,0x346ED9FC,0xAD678846,0xDA60B8D0,
   0x44042D73,0x33031DE5,0xAA0A4C5F,0xDD0D7CC9,0x5005713C,0x270241AA,
   0xBE0B1010,0xC90C2086,0x5768B525,0x206F85B3,0xB966D409,0xCE61E49F,
   0x5EDEF90E,0x29D9C998,0xB0D09822,0xC7D7A8B4,0x59B33D17,0x2EB40D81,
   0xB7BD5C3B,0xC0BA6CAD,0xEDB88320,0x9ABFB3B6,0x03B6E20C,0x74B1D29A,
   0xEAD54739,0x9DD277AF,0x04DB2615,0x73DC1683,0xE3630B12,0x94643B84,
   0x0D6D6A3E,0x7A6A5AA8,0xE40ECF0B,0x9309FF9D,0x0A00AE27,0x7D079EB1,
   0xF00F9344,0x8708A3D2,0x1E01F268,0x6906C2FE,0xF762575D,0x806567CB,
   0x196C3671,0x6E6B06E7,0xFED41B76,0x89D32BE0,0x10DA7A5A,0x67DD4ACC,
   0xF9B9DF6F,0x8EBEEFF9,0x17B7BE43,0x60B08ED5,0xD6D6A3E8,0xA1D1937E,
   0x38D8C2C4,0x4FDFF252,0xD1BB67F1,0xA6BC5767,0x3FB506DD,0x48B2364B,
   0xD80D2BDA,0xAF0A1B4C,0x36034AF6,0x41047A60,0xDF60EFC3,0xA867DF55,
   0x316E8EEF,0x4669BE79,0xCB61B38C,0xBC66831A,0x256FD2A0,0x5268E236,
   0xCC0C7795,0xBB0B4703,0x220216B9,0x5505262F,0xC5BA3BBE,0xB2BD0B28,
   0x2BB45A92,0x5CB36A04,0xC2D7FFA7,0xB5D0CF31,0x2CD99E8B,0x5BDEAE1D,
   0x9B64C2B0,0xEC63F226,0x756AA39C,0x026D930A,0x9C0906A9,0xEB0E363F,
   0x72076785,0x05005713,0x95BF4A82,0xE2B87A14,0x7BB12BAE,0x0CB61B38,
   0x92D28E9B,0xE5D5BE0D,0x7CDCEFB7,0x0BDBDF21,0x86D3D2D4,0xF1D4E242,
   0x68DDB3F8,0x1FDA836E,0x81BE16CD,0xF6B9265B,0x6FB077E1,0x18B74777,
   0x88085AE6,0xFF0F6A70,0x66063BCA,0x11010B5C,0x8F659EFF,0xF862AE69,
   0x616BFFD3,0x166CCF45,0xA00AE278,0xD70DD2EE,0x4E048354,0x3903B3C2,
   0xA7672661,0xD06016F7,0x4969474D,0x3E6E77DB,0xAED16A4A,0xD9D65ADC,
   0x40DF0B66,0x37D83BF0,0xA9BCAE53,0xDEBB9EC5,0x47B2CF7F,0x30B5FFE9,
   0xBDBDF21C,0xCABAC28A,0x53B39330,0x24B4A3A6,0xBAD03605,0xCDD70693,
   0x54DE5729,0x23D967BF,0xB3667A2E,0xC4614AB8,0x5D681B02,0x2A6F2B94,
   0xB40BBE37,0xC30C8EA1,0x5A05DF1B,0x2D02EF8D
};

//----------------------------------------------------------------------------
void  HardwareInit(void)
{
   int i;

 //-- Crystal 12 MHz

 //---  Peripheral - on max speed  bits 1..0 = 01 -> prc;
   rVPBDIV = 0x00000001;

 //--- PLL(Fout = 60MHz) - multiplay at 5 (F = Fosc * MSEL * 2 * P / 2*P)

   rPLL0CFG = (1<<5) | 0x4;  //-- MSEL = 5 [4:0] = 00100;   P=2 ([6:5] = 01)
   rPLL0CON = 0x03;          //-- PLLE = 1; PLLC = 1

   for(i=0;i<100;i++);
   rPLL0FEED = 0xAA;
   rPLL0FEED = 0x55;
   for(i=0;i<100;i++);

  //--- Disable all int ------

   VICIntEnable = 0;

   VICDefVectAddr = (unsigned int)tn_int_default_func; //-- default int processing

 //--- Timer 0  - interrupt 10 ms

   rT0PR = 0;  //-- Prscaler = 0
   rT0PC = 0;

   rT0MR0 = 60000 * 10;
   rT0MCR = 3; //-- bit 0=1 -int on MR0 , bit 1=1 - Reset on MR0

   rT0TCR = 1; //-- Timer 0 - run

   //--  int for Timer 0
   VICVectAddr1 = (unsigned int)tn_timer0_int_func;   //-- Timer 0 int - priority top-1
   VICVectCntl1 = 0x20 | 4;
   VICIntEnable = (1<<4);

 //---- UART 0 ----

   InitUART0();

   //--  int for UART0
  // VICVectAddr2 = (unsigned int)tn_uart0_int_func;   //-- UART0 int - priority top-2
 //  VICVectCntl2 = 0x20 | 6;
 //  VICIntEnable = (1 << 6);

 //---- USB ----

   InitUSB();

   //-- int for USB
   VICVectAddr0 = (unsigned int)tn_usb_int_func;   //-- USB int - top priority
   VICVectCntl0 = 0x20 | 22;
   VICIntEnable = (1 << 22);

 //--- Pins - to output & set to initial values ------------------------------

//   rIO0DIR |= 1<<2;  //-- output
//   rIO0SET |= 1<<2;  //-- Set P0.2 to 1

//-- P0.2 - P0.22  - GPIO/out

#define MASK_PINS_P0_2_P0_22   0x007FFFFC

   rIO0DIR |= MASK_PINS_P0_2_P0_22;  //-- output
   rIO0SET |= MASK_PINS_P0_2_P0_22;  //-- Set  to 1

//-- P0.23 -  VBUS                auto                in
//-- P0.25 - P0.30 - GPIO/out

#define MASK_PINS_P0_25_P0_30  0x7E000000

   rIO0DIR |= MASK_PINS_P0_25_P0_30;  //-- output
   rIO0SET |= MASK_PINS_P0_25_P0_30;  //-- Set  to 1

   rIO0CLR |= LED_APP_MASK; //-- App LED - off

//-- P1.16 - P1.19 - GPIO/out

#define MASK_PINS_P1_16_P1_19  0x000F0000

   rIO0DIR |= MASK_PINS_P1_16_P1_19;  //-- output
   rIO0SET |= MASK_PINS_P1_16_P1_19;  //-- Set  to 1


//-- P1.21 - P1.25 - GPIO/out

#define MASK_PINS_P1_21_P1_25  0x03E00000

   rIO0DIR |= MASK_PINS_P1_21_P1_25;  //-- output
   rIO0SET |= MASK_PINS_P1_21_P1_25;  //-- Set  to 1

//-----------------------------

}

//----------------------------------------------------------------------------
// UART0 init - FIFO enabled,IRQ enabled(later)
//----------------------------------------------------------------------------
void InitUART0(void)
{
   //---- pinout -----
   rPINSEL0 |= (1<<2) | 1; //-- Pins P0.0 & P0.1 - for UART0
    //-- enable access to divisor latch regs
   rU0LCR = LCR_ENABLE_LATCH_ACCESS;
    //-- set divisor for desired baud
   rU0DLM = 0;
   rU0DLL = 32; // 32;    // (14.746*4)/16*115200  = 32
    //-- disable access to divisor latch regs (enable access to xmit/rcv fifos
    //-- and int enable regs)
   rU0LCR = LCR_DISABLE_LATCH_ACCESS;

  //-- Enable UART0 rx interrupts
   rU0IER = 3;  //-- Enable RDA(Receive Data Available) int

   rU0FCR = (0x3<<6) | 1;  //-- Int Trigger - 0xE bytes, Enable FIFO,Reset Tx FIFO & Rx FIFO
    //-- setup line control reg - disable break transmittion, even parity,
    //-- 1 stop bit, 8 bit chars
   rU0LCR = 0x13;//-- 0b00010011
}

//----------------------------------------------------------------------------
static void InitUSB(void)  //-- Hardware init
{
   int i;

  //-- VBUS & SoftConnect pins
   rPINSEL1 |= 1<<14;      //-- P0.23 -> VBUS
   rPINSEL1 |= 2u << 30;   //-- P0.31 -> CONNECT

  //--- USB PLL -PLL1(Fout = 48MHz) - multiplay at 4 (F = Fosc * MSEL * 2 * P / 2*P)

   rPLL1CFG = 0x23;  //-- b00100011 bits 4..0 - MSEL4:0 = 4(3+1); bits 6:5 - PSEL 1:0 = 2(1+1);
   rPLL1CON = 0x03;  //-- PLLE = 1; PLLC = 1

   for(i=0;i<100;i++);
   rPLL1FEED = 0xAA;
   rPLL1FEED = 0x55;
   while(!(rPLL1STAT & (1<<10))); // Wait for PLL Lock

  //-- Enable USB hardware

   rPCONP |= 1u << 31;

  //-- Cmd- disconnect

   tn_usb_lpc_cmd_write(CMD_DEV_STATUS,0);

     //-- Endpoints  int
   rUSBEpIntClr = 0xFFFFFFFF;

   tn_usb_config_EP0();

     //-- USB device int
   rUSBDevIntClr = 0xFFFFFFFF;
   rUSBDevIntEn |= (1<<3) | (1<<2); //-- DEV_STAT,EP_SLOW

   tn_usb_set_addr(0);
}

//----------------------------------------------------------------------------
void * s_memset(void * dst,  int ch, int length)
{
  register char *ptr = (char *)dst - 1;

  while(length--)
     *++ptr = ch;

  return dst;
}

//----------------------------------------------------------------------------
void * s_memcpy(void * s1, const void *s2, int n)
{
   register int mask = (int)s1 | (int)s2 | n;

   if(n == 0)
      return s1;

   if(mask & 0x1)
   {
      register const char *src = s2;
      register char *dst = s1;

      do
      {
         *dst++ = *src++;
      }while(--n);

      return s1;
   }

   if(mask & 0x2)
   {
      register const short *src = s2;
      register       short *dst = s1;

      do
      {
        *dst++ = *src++;
      }while( n -= 2);

      return s1;
   }
   else
   {
      register const int *src = s2;
      register       int *dst = s1;

      do
      {
         *dst++ = *src++;
      }while (n -= 4);

      return s1;
   }
}

//----------------------------------------------------------------------------
unsigned int calc_crc(unsigned char * buf,int nbytes)
{
   unsigned int result;
   int i;

   result = 0xffffffff;
   for(i=0; i < nbytes; i++)
      result = (result >> 8) ^ crc32_ref_table[(result & 0xFF) ^ buf[i]];
   result ^= 0xffffffff;

   return result;
}

//----------------------------------------------------------------------------
void make_cmd(int cmd,unsigned char * buf)
{
   unsigned int rc;

   buf[0] = cmd & 0xFF;
   rc = calc_crc(buf,CTRL_BUF_CRC_OFF); //-- 60
   s_memcpy(&buf[CTRL_BUF_CRC_OFF],&rc, sizeof(int)); //-- Little Endian
}

//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
//----------------------------------------------------------------------------





























